src/Documents/НДФЛСтандартныеВычетыФизлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НДФЛСтандартныеВычетыФизлиц</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьЛичныйВычет</Name>
					<Comment>Применять личный вычет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСемьи</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Comment>Дата рождения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименятьВычет</Name>
							<Comment>Применять вычет</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВычета</Name>
							<Comment>Код вычета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаВычета</Name>
							<Comment>Дата начала вычета</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонцаВычета</Name>
							<Comment>Дата окончания вычета</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛНРебенок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/НДФЛСтандартныеВычетыФизлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НДФЛСтандартныеВычетыФизлиц</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодВычетаЛичный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВычетаНаДетей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДетей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВычетаНаДетейИнвалидов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДетейИнвалидов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВычетаДополнительный</Name>
					<Comment>Вычет, предоставляемый в размере 10 базовых величин (Статья 3 п 2.3 Закона о подоходном налоге с физических лиц</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВычетаНаДетейЛьгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДетейЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВычетаМолодыеСпециалисты</Name>
					<Comment>Стандартный вычет молодым специалистам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/НДФЛСтандартныеВычетыФизлиц/Ext/ObjectModule.bsl
Процедура ПерерасчетДокумента() Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
		"ВЫБРАТЬ
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета КАК Дата,
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
		|	СУММА(1) КАК Действие
		|ИЗ
		|	Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
		|ГДЕ
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка = &Ссылка
		|	И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета,
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета,
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
		|	СУММА(-1)
		|ИЗ
		|	Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
		|ГДЕ
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка = &Ссылка
		|	И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета,
		|	НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Действие УБЫВ";
	мЗапрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	мВыборка = мЗапрос.Выполнить().Выбрать();
	
	мНаборЗаписейНДФЛСтандартныеВычетыФизлиц = РегистрыСведений.НДФЛСтандартныеВычетыФизлиц.СоздатьНаборЗаписей();
	мНаборЗаписейНДФЛСтандартныеВычетыФизлиц.Отбор.ФизЛицо.Значение = ЭтотОбъект.Физлицо.Ссылка;
    мНаборЗаписейНДФЛСтандартныеВычетыФизлиц.Отбор.ФизЛицо.Использование = Истина;
	ЗаписьНабораП = РегистрыСведений.НДФЛСтандартныеВычетыФизлиц.СоздатьНаборЗаписей().Добавить();
	мДата = '00010101000000';
	Если ЭтотОбъект.ПрименятьЛичныйВычет Тогда
		ЗаписьНабора = мНаборЗаписейНДФЛСтандартныеВычетыФизлиц.Добавить();
		ЗаписьНабора.Период 							= '19000101000000';
		ЗаписьНабора.Физлицо 							= ЭтотОбъект.Физлицо.Ссылка;
		ЗаписьНабора.КодВычетаЛичный 					= Справочники.ВычетыНДФЛ.Код600;
		ЗаписьНабораП.Период = ЗаписьНабора.Период;
		ЗаписьНабораП.КодВычетаЛичный = ЗаписьНабора.КодВычетаЛичный;
	КонецЕсли;
	Пока мВыборка.Следующий() Цикл
		Если мВыборка.Действие < 0 Тогда
			мДатаН = ДобавитьМесяц(НачалоМесяца(мВыборка.Дата), 1);
		Иначе
			мДатаН = НачалоМесяца(мВыборка.Дата);
		КонецЕсли;
		Если мДата <> мДатаН Тогда
			мДата = мДатаН;
			ЗаписьНабора = мНаборЗаписейНДФЛСтандартныеВычетыФизлиц.Добавить();
		КонецЕсли;
		ЗаписьНабора.Физлицо = ЭтотОбъект.Физлицо.Ссылка;
		ЗаписьНабора.КодВычетаЛичный = ЗаписьНабораП.КодВычетаЛичный;
		ЗаписьНабора.КодВычетаНаДетей = ЗаписьНабораП.КодВычетаНаДетей;
		ЗаписьНабора.КоличествоДетей = ЗаписьНабораП.КоличествоДетей;
		ЗаписьНабора.КодВычетаНаДетейЛьгота = ЗаписьНабораП.КодВычетаНаДетейЛьгота;
		ЗаписьНабора.КоличествоДетейЛьгота = ЗаписьНабораП.КоличествоДетейЛьгота;
		ЗаписьНабора.КодВычетаДополнительный = ЗаписьНабораП.КодВычетаДополнительный;
		
		//Аверсон ЕАЕ 10.01.2024 СВФР-012095
		ЗаписьНабора.КодВычетаМолодыеСпециалисты = ЗаписьНабораП.КодВычетаМолодыеСпециалисты;
		//Аверсон СВФР-012095
		
		Если мВыборка.Действие < 0 Тогда
			ЗаписьНабора.Период = ДобавитьМесяц(мВыборка.Дата, 1);
		Иначе
			ЗаписьНабора.Период = мВыборка.Дата;
		КонецЕсли;
		Если мВыборка.КодВычета = Справочники.ВычетыНДФЛ.Код610 Тогда
			ЗаписьНабора.КодВычетаНаДетей = Справочники.ВычетыНДФЛ.Код610;
			ЗаписьНабора.КоличествоДетей = ЗаписьНабора.КоличествоДетей + мВыборка.Действие;
			Если ЗаписьНабора.КоличествоДетей = 0 Тогда
				ЗаписьНабора.КодВычетаНаДетей = Справочники.ВычетыНДФЛ.ПустаяСсылка();
				ЗаписьНабора.КоличествоДетей = 0;
			КонецЕсли;
		ИначеЕсли мВыборка.КодВычета = Справочники.ВычетыНДФЛ.Код611 Тогда
			ЗаписьНабора.КодВычетаНаДетейЛьгота = Справочники.ВычетыНДФЛ.Код611;
			ЗаписьНабора.КоличествоДетейЛьгота = ЗаписьНабора.КоличествоДетейЛьгота + мВыборка.Действие;
			Если ЗаписьНабора.КоличествоДетейЛьгота = 0 Тогда
				ЗаписьНабора.КодВычетаНаДетейЛьгота = Справочники.ВычетыНДФЛ.ПустаяСсылка();
				ЗаписьНабора.КоличествоДетейЛьгота = 0;
			КонецЕсли;
		ИначеЕсли мВыборка.КодВычета = Справочники.ВычетыНДФЛ.Код620 Тогда
			Если мВыборка.Действие = 1 Тогда
				ЗаписьНабора.КодВычетаДополнительный= Справочники.ВычетыНДФЛ.Код620;
			Иначе
				ЗаписьНабора.КодВычетаДополнительный= Справочники.ВычетыНДФЛ.ПустаяСсылка();
			КонецЕсли;
			
		//Аверсон ЕАЕ 10.01.2024 СВФР-012095
		ИначеЕсли мВыборка.КодВычета = Справочники.ВычетыНДФЛ.Код601 Тогда
			Если мВыборка.Действие = 1 Тогда
				ЗаписьНабора.КодВычетаМолодыеСпециалисты = Справочники.ВычетыНДФЛ.Код601;
			Иначе
				ЗаписьНабора.КодВычетаМолодыеСпециалисты = Справочники.ВычетыНДФЛ.ПустаяСсылка();
			КонецЕсли;
		//Аверсон СВФР-012095
		КонецЕсли;
		ЗаписьНабораП.КодВычетаЛичный = ЗаписьНабора.КодВычетаЛичный;
		ЗаписьНабораП.КодВычетаНаДетей = ЗаписьНабора.КодВычетаНаДетей;
		ЗаписьНабораП.КоличествоДетей = ЗаписьНабора.КоличествоДетей;
		ЗаписьНабораП.КодВычетаНаДетейЛьгота = ЗаписьНабора.КодВычетаНаДетейЛьгота;
		ЗаписьНабораП.КоличествоДетейЛьгота = ЗаписьНабора.КоличествоДетейЛьгота;
		ЗаписьНабораП.КодВычетаДополнительный = ЗаписьНабора.КодВычетаДополнительный;
		
		//Аверсон ЕАЕ 10.01.2024 СВФР-012095
		ЗаписьНабораП.КодВычетаМолодыеСпециалисты = ЗаписьНабора.КодВычетаМолодыеСпециалисты;
		//Аверсон СВФР-012095
		
	КонецЦикла;
	мНаборЗаписейНДФЛСтандартныеВычетыФизлиц.Записать();
КонецПроцедуры
